{
    "_class_name": "StableDiffusionPipeline",
    "model_type": "StableDiffusionPipeline",
    "scheduler": {
        "_class_name": "EulerDiscreteScheduler",
        "beta_end": 0.012,
        "beta_schedule": "scaled_linear",
        "beta_start": 0.00085,
        "clip_sample": false,
        "num_train_timesteps": 1000,
        "prediction_type": "epsilon",
        "set_alpha_to_one": false,
        "skip_prk_steps": true,
        "steps_offset": 1,
        "timestep_spacing": "leading"
    },
    "text_encoder_config": {
        "_name_or_path": "openai/clip-vit-large-patch14",
        "architectures": ["CLIPTextModel"],
        "attention_dropout": 0.0,
        "bos_token_id": 0,
        "dropout": 0.0,
        "hidden_act": "quick_gelu",
        "hidden_size": 768,
        "initializer_factor": 1.0,
        "initializer_range": 0.02,
        "intermediate_size": 3072,
        "layer_norm_eps": 1e-05,
        "max_position_embeddings": 77,
        "model_type": "clip_text_model",
        "num_attention_heads": 12,
        "num_hidden_layers": 12,
        "pad_token_id": 1,
        "projection_dim": 768,
        "torch_dtype": "float16",
        "transformers_version": "4.25.0.dev0",
        "vocab_size": 49408
    },
    "unet": {
        "sample_size": 64,
        "in_channels": 4,
        "out_channels": 4,
        "down_block_types": [
            "CrossAttnDownBlock2D",
            "CrossAttnDownBlock2D",
            "CrossAttnDownBlock2D",
            "DownBlock2D"
        ],
        "up_block_types": [
            "UpBlock2D",
            "CrossAttnUpBlock2D",
            "CrossAttnUpBlock2D",
            "CrossAttnUpBlock2D"
        ],
        "block_out_channels": [320, 640, 1280, 1280],
        "layers_per_block": 2,
        "cross_attention_dim": 768,
        "attention_head_dim": 8,
        "use_linear_projection": false,
        "class_embed_type": null,
        "num_class_embeds": null,
        "upcast_attention": false,
        "resnet_time_scale_shift": "default",
        "time_embedding_type": "positional",
        "timestep_post_act": null,
        "time_cond_proj_dim": null,
        "conv_in_kernel": 3,
        "conv_out_kernel": 3,
        "projection_class_embeddings_input_dim": null,
        "addition_embed_type": null,
        "addition_time_embed_dim": null
    },
    "vae": {
        "in_channels": 3,
        "out_channels": 3,
        "down_block_types": ["DownEncoderBlock2D", "DownEncoderBlock2D", "DownEncoderBlock2D", "DownEncoderBlock2D"],
        "up_block_types": ["UpDecoderBlock2D", "UpDecoderBlock2D", "UpDecoderBlock2D", "UpDecoderBlock2D"],
        "block_out_channels": [128, 256, 512, 512],
        "layers_per_block": 2,
        "latent_channels": 4,
        "sample_size": 512,
        "scaling_factor": 0.18215
    }
} 